Tekla Open API Reference for Tekla Structures 2025
BoltGroup.ErrorStatus Enumeration
 Define possible statuses for geometry creation/modification commands.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ErrorStatus
Public Enumeration ErrorStatus
Members
Member name | Value | Description
CommonSettingFromDiffPropertiesException | 0 |  Exception thrown when the common setting cannot be computed from the individual settings.
SlottedHoleOffsetsTooBigException | 1 |  Exception thrown when the slotted hole offsets move hole too far from bolt origin.
See Also
Reference
Tekla.Structures.Model Namespace